{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "山间之风",
  "home_page_url": "https://imirai.xyz/en/",
  "feed_url": "https://imirai.xyz/en/feed.json",
  "description": "Hoo's blog",
  "items": [
    {
      "title": "AutoDL GPU Container Multi-GPU Interconnect Test - Beijing Zone A - 2080Ti x2",
      "url": "https://imirai.xyz/en/posts/AutoDL_Multi-GPU_Interconnection_Test.html",
      "id": "https://imirai.xyz/en/posts/AutoDL_Multi-GPU_Interconnection_Test.html",
      "summary": "AutoDL platform 2080Ti dual-GPU interconnect performance test report. Detailed analysis of P2P communication and NCCL collective communication performance bottlenecks under PCIe 3.0 x16 topology, providing reference for multi-GPU training environment setup.",
      "content_html": "\n<p>Due to business needs, we may rent servers from AutoDL for model training, so we tested the performance of multi-GPU interconnect for consumer-grade graphics cards (original 2080Ti 11G) on their platform. The results are placed here for reference.</p>\n<p>TL;DR: No NVLink. Although running on a PCIe 3.0x16 switch and both CPU NUMA nodes are connected to the PCIe switch, P2P communication is unavailable due to driver issues, resulting in poor multi-GPU interconnect performance.</p>\n<blockquote>\n<p>The following is a summary from DeepSeek-R1-0528</p>\n</blockquote>\n",
      "date_published": "2025-06-05T00:00:00.000Z",
      "date_modified": "2025-08-14T09:12:21.000Z",
      "authors": [],
      "tags": [
        "AI"
      ]
    },
    {
      "title": "Hello World",
      "url": "https://imirai.xyz/en/posts/helloworld.html",
      "id": "https://imirai.xyz/en/posts/helloworld.html",
      "summary": "山间之风 Blog - A technical blog built with VuePress, sharing technical articles, study notes, project summaries and life insights. Explore development experiences and practical knowledge.",
      "content_html": "\n<p>Welcome to 山间之风! This is <s>my first post</s> not really. Due to some force majeure, the blog has been abandoned for a long time.</p>\n<h2>About This Blog</h2>\n<p>This blog is rebuilt with VuePress. I have used Hexo, Typecho, or WordPress before, but this time I'm back to the static site generator, and it's great.</p>\n<h2>What You Can Find Here</h2>\n<ul>\n<li>Technical articles and tutorials</li>\n<li>Study notes and thoughts</li>\n<li>Project sharing and summaries</li>\n<li>Life reflections</li>\n<li><s>None of the above are guaranteed</s></li>\n</ul>\n<h2>Start Exploring</h2>\n<p>In short, I hope you can find useful content here. If you have any suggestions or ideas, feel free to contact me via the email link on the right of homepage!</p>\n",
      "date_published": "2025-01-01T00:00:00.000Z",
      "date_modified": "2025-08-14T09:12:21.000Z",
      "authors": [],
      "tags": [
        "Blog"
      ]
    }
  ]
}